In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj.drop('c')  # Series删除指定索引的条目，返回新对象而并没有直接操作原始对象

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [3]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [4]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data.drop(['Colorado', 'Ohio'])  # DataFrame删除指定索引上的值，返回新对象而并没有直接操作原始对象

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [5]:
data.drop(['two', 'four'], axis='columns')  # <==> data.drop(['two', 'four'], axis=1)，删除指定的列，返回新对象

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [6]:
data.drop(['Colorado', 'Ohio'], inplace=True)  # 使用inplace选项，可以直接更改原始的Series或DataFrame
data

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15